[
    "Topic: Definition of Jawi Script. Explanation: Jawi script is a variant of the Arabic script consisting of 35 characters. It includes the 29 original Arabic characters plus 6 additional characters created to accommodate sounds in the Malay language. Jawi script is written from right to left and is one of the oldest writing systems in the Malay Archipelago.",
    "Topic: Brief History of Jawi Script. Explanation: Jawi script developed concurrently with the arrival of Islam in the Malay Archipelago around the 13th century. The oldest evidence of its use is found on the Terengganu Inscription Stone, dated 1303 AD. The script reached its peak from the 17th to the early 20th century, used in royal administration, literature, and education before its role was largely replaced by the Rumi (Latin) script.",
    "Topic: Writing Rules: Connection Rules. Explanation: Most Jawi letters can be connected at the beginning, middle, and end of a word. However, some letters cannot be connected to the letter that follows them: Alif (ا), Wau (و), Va (ۏ), Dal (د), Zal (ذ), Ra (ر), and Zai (ز). After these letters, the word is 'broken,' and the next letter is written in its isolated form.",
    "Topic: Writing Rules: Vowel System. Explanation: In Jawi writing, vowels are often represented by 'vowel letters' (huruf saksi). The letter Alif (ا) is used for the 'a' vowel, the letter Wau (و) for 'u' and 'o' vowels, and the letter Ya (ي) for 'i' and 'e' vowels. The use of these vowel letters follows a set of complex rules.",
    "Topic: Unique Additional Jawi Letters. Explanation: There are 6 additional letters created to accommodate Malay sounds that do not exist in Arabic. These letters are Ca (چ), Nga (ڠ), Pa (ڤ), Ga (ݢ), Va (ۏ), and Nya (ڽ). These six letters have different forms depending on their position in a word.",
    "Letter name: Ca Isolated. Jawi character form: چ. Info: The isolated form of the letter Ca (چ). It is one of the 6 additional Jawi letters used for the 'c' sound, as in the word 'cahaya' (light). Example word in Latin is 'cahaya' and in Jawi is 'چهاي'.",
    "Letter name: Ca Initial. Jawi character form: چـ. Info: The initial (start) form of the letter Ca (چ). An example of its use is in the word 'cerita' (story). Example word in Latin is 'cerita' and in Jawi is 'چريتا'.",
    "Letter name: Ca Medial. Jawi character form: ـچـ. Info: The medial (middle) form of the letter Ca (چ). An example of its use is in the word 'baca' (read). Example word in Latin is 'baca' and in Jawi is 'باچ'.",
    "Letter name: Ca Final. Jawi character form: ـچ. Info: The final (end) form of the letter Ca (چ). An example of its use is in the word 'kaca' (glass). Example word in Latin is 'kaca' and in Jawi is 'كاچ'.",
    "Letter name: Ga Isolated. Jawi character form: ݢ. Info: The isolated form of the letter Ga (ݢ). It is one of the 6 additional Jawi letters used for the 'g' sound, as in the word 'guli' (marbles). Example word in Latin is 'guli' and in Jawi is 'ݢولي'.",
    "Letter name: Ga Initial. Jawi character form: ݢـ. Info: The initial (start) form of the letter Ga (ݢ). An example of its use is in the word 'gajah' (elephant). Example word in Latin is 'gajah' and in Jawi is 'ݢاجه'.",
    "Letter name: Ga Medial. Jawi character form: ـݢـ. Info: The medial (middle) form of the letter Ga (ݢ). An example of its use is in the word 'tiga' (three). Example word in Latin is 'tiga' and in Jawi is 'تيݢا'.",
    "Letter name: Ga Final. Jawi character form: ـݢ. Info: The final (end) form of the letter Ga (ݢ). An example of its use is in the word 'beg' (bag). Example word in Latin is 'beg' and in Jawi is 'بيݢ'.",
    "Letter name: Nga Isolated. Jawi character form: ڠ. Info: The isolated form of the letter Nga (ڠ). It is one of the 6 additional Jawi letters used for the 'ng' sound, as in the word 'nganga' (agape). Example word in Latin is 'nganga' and in Jawi is 'ڠاڠا'.",
    "Letter name: Nga Initial. Jawi character form: ڠـ. Info: The initial (start) form of the letter Nga (ڠ). An example of its use is in the word 'ngaji' (recite). Example word in Latin is 'ngaji' and in Jawi is 'ڠاجي'.",
    "Letter name: Nga Medial. Jawi character form: ـڠـ. Info: The medial (middle) form of the letter Nga (ڠ). An example of its use is in the word 'pangan' (food). Example word in Latin is 'pangan' and in Jawi is 'ڤاڠن'.",
    "Letter name: Nga Final. Jawi character form: ـڠ. Info: The final (end) form of the letter Nga (ڠ). An example of its use is in the word 'senang' (happy). Example word in Latin is 'senang' and in Jawi is 'سنڠ'.",
    "Letter name: Nya Isolated. Jawi character form: ڽ. Info: The isolated form of the letter Nya (ڽ). It is one of the 6 additional Jawi letters used for the 'ny' sound, as in the word 'nyanyi' (sing). Example word in Latin is 'nyanyi' and in Jawi is 'ڽاڽي'.",
    "Letter name: Nya Initial. Jawi character form: ڽـ. Info: The initial (start) form of the letter Nya (ڽ). An example of its use is in the word 'nyamuk' (mosquito). Example word in Latin is 'nyamuk' and in Jawi is 'ڽاموق'.",
    "Letter name: Nya Medial. Jawi character form: ـڽـ. Info: The medial (middle) form of the letter Nya (ڽ). An example of its use is in the word 'banyak' (many). Example word in Latin is 'banyak' and in Jawi is 'باڽق'.",
    "Letter name: Nya Final. Jawi character form: ـڽ. Info: The final (end) form of the letter Nya (ڽ). An example of its use is in the word 'sunyi' (silent). Example word in Latin is 'sunyi' and in Jawi is 'سوڽي'.",
    "Letter name: Pa Isolated. Jawi character form: ڤ. Info: The isolated form of the letter Pa (ڤ). It is one of the 6 additional Jawi letters used for the 'p' sound, as in the word 'pasu' (vase). Example word in Latin is 'pasu' and in Jawi is 'ڤاسو'.",
    "Letter name: Pa Initial. Jawi character form: ڤـ. Info: The initial (start) form of the letter Pa (ڤ). An example of its use is in the word 'pagi' (morning). Example word in Latin is 'pagi' and in Jawi is 'ڤاݢي'.",
    "Letter name: Pa Medial. Jawi character form: ـڤـ. Info: The medial (middle) form of the letter Pa (ڤ). An example of its use is in the word 'sapu' (sweep). Example word in Latin is 'sapu' and in Jawi is 'ساڤو'.",
    "Letter name: Pa Final. Jawi character form: ـڤ. Info: The final (end) form of the letter Pa (ڤ). An example of its use is in the word 'atap' (roof). Example word in Latin is 'atap' and in Jawi is 'اتڤ'.",
    "Letter name: Va Isolated. Jawi character form: ۏ. Info: The isolated form of the letter Va (ۏ). It is one of the 6 additional Jawi letters used for the 'v' sound, as in loanwords like 'video'. Example word in Latin is 'video' and in Jawi is 'ۏيديو'.",
    "Letter name: Va Final. Jawi character form: ـۏ. Info: The final (end) form of the letter Va (ۏ). As it cannot be connected to a following letter, this form only appears at the end of a word, for example in loanwords like 'bravo'. Example word in Latin is 'bravo' and in Jawi is 'براۏو'."
]